In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,precision_score,recall_score,f1_score,confusion_matrix,classification_report
import statsmodels.api as sm
from sklearn.preprocessing import StandardScaler, LabelEncoder
titanic_df=pd.read_csv(r"tested.csv")
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [2]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [3]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [4]:
titanic_df["Age"]= titanic_df["Age"].fillna(titanic_df["Age"].median())
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [5]:
titanic_df["Fare"]= titanic_df["Fare"].fillna(titanic_df["Fare"].median())
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          418 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         418 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [6]:
titanic_df= titanic_df.drop("Cabin", axis=1)

In [7]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [8]:
identity=titanic_df[["PassengerId","Name","Ticket"]]
identity.head()

   PassengerId                                          Name   Ticket
0          892                              Kelly, Mr. James   330911
1          893              Wilkes, Mrs. James (Ellen Needs)   363272
2          894                     Myles, Mr. Thomas Francis   240276
3          895                              Wirz, Mr. Albert   315154
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  3101298

In [9]:
titanic_df=pd.get_dummies(titanic_df,columns=["Pclass","Embarked"],drop_first=True,dtype=int)
titanic_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,0,1,1,0
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,0,1,0,1
2,894,0,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,1,0,1,0
3,895,0,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,0,1,0,1

In [10]:
le= LabelEncoder()
titanic_df["Sex"]=le.fit_transform(titanic_df["Sex"])
titanic_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,0,1,1,0
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,0,1,0,1
2,894,0,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,1,0,1,0
3,895,0,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,0,1,0,1

In [11]:
gender_survived= titanic_df.groupby("Sex")["Survived"].agg("count")
gender_survived

Sex
0    152
1    266
Name: Survived, dtype: int64

In [12]:
survived= titanic_df[titanic_df["Survived"]==1]
survived.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,0,1,0,1
6,898,1,"Connolly, Miss. Kate",0,30.0,0,0,330972,7.6292,0,1,1,0
8,900,1,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",0,18.0,0,0,2657,7.2292,0,1,0,0
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",0,23.0,1,0,21228,82.2667,0,0,0,1

In [13]:
survived_gender= survived.groupby("Sex")["Survived"].agg("count")
survived_gender

Sex
0    152
Name: Survived, dtype: int64

In [14]:
survived["Sex"].value_counts()

Sex
0    152
Name: count, dtype: int64

In [15]:
titanic_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,0,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,0,1,1,0
1,893,1,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,0,1,0,1
2,894,0,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,1,0,1,0
3,895,0,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,0,1,0,1
4,896,1,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,0,1,0,1

In [16]:
Y= titanic_df["Survived"]
X= titanic_df.drop(["Survived","PassengerId","Name","Ticket"], axis=1)
X.head()

,Sex,Age,SibSp,Parch,Fare,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,1,34.5,0,0,7.8292,0,1,1,0
1,0,47.0,1,0,7.0000,0,1,0,1
2,1,62.0,0,0,9.6875,1,0,1,0
3,1,27.0,0,0,8.6625,0,1,0,1
4,0,22.0,1,1,12.2875,0,1,0,1

In [17]:
X_train,X_test,Y_train,Y_test= train_test_split(X,Y,test_size=0.2,random_state=42)

In [18]:
lr=LogisticRegression()
model= lr.fit(X_train,Y_train)

C:\Users\ADMIN\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\LocalCache\local-packages\Python312\site-packages\sklearn\linear_model\_logistic.py:473: ConvergenceWarning: lbfgs failed to converge after 100 iteration(s) (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT

Increase the number of iterations to improve the convergence (max_iter=100).
You might also want to scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [19]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sex         418 non-null    int64
 1   Age         418 non-null    float64
 2   SibSp       418 non-null    int64
 3   Parch       418 non-null    int64
 4   Fare        418 non-null    float64
 5   Pclass_2    418 non-null    int64
 6   Pclass_3    418 non-null    int64
 7   Embarked_Q  418 non-null    int64
 8   Embarked_S  418 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 29.5 KB

In [21]:
Y_pred= model.predict(X_test)

In [22]:
#evaluating the model
accuracy_score(Y_pred,Y_test)

1.0

In [23]:
precision_score(Y_pred,Y_test)

1.0

In [24]:
recall_score(Y_pred,Y_test)

1.0